app/controllers/api/v1/destinations_controller.rb

	def index
		@destinations = Destination.all
---
SELECT "destinations".* FROM "destinations"

	def create
		@destination = Destination.new(destination_params)

		if @destination.save
---
INSERT INTO "destinations" ("name", "image", "description", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def update
		if @destination.update(destination_params)
---
UPDATE "destinations" SET "tag_id" = ?, "updated_at" = ? WHERE "destinations"."id" = ?  [["tag_id", 4], ["updated_at", "2015-10-08 05:32:16.418307"], ["id", 2]]

	def destroy
		@destination.destroy
---
DELETE FROM "destinations" WHERE "destinations"."id" = ?  [["id", 2]]

	def set_destination
		@destination = Destination.find(params[:id])
---
SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT 1  [["id", 15]]