app/controllers/api/v1/tags_controller.rb

	def index
		#byebug
		@tags = Tag.all
---
SELECT "tags".* FROM "tags"

	def create
		#byebug
		@tag = Tag.new(tag_params)

		if @tag.save
---
INSERT INTO "tags" ("title", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Damn"], ["image", "Dadada"], ["created_at", "2015-10-02 09:09:52.362034"], ["updated_at", "2015-10-02 09:09:52.362034"]]

	def update
		#byebug
		if @tag.update(tag_params)
---
UPDATE "tags" SET "image" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["image", "https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcRrnWjDtNHj6a9FQffjdXOQmBsMm-EOUBvkGxxApTkc0UBcj1QVNu92tBk"], ["updated_at", "2015-10-08 01:52:15.887194"], ["id", 16]]

	def destroy
		@tag.destroy
---
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 13]]

	def set_tag
		@tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 15]]